#pragma once
#include <set>

class Median
{
public:
    Median() = default;

    void add(int number);
    double getMedian() const;

private:
    std::multiset<int> numbers_;
};

/*
 *

Напишете структура данни, която поддържа две операции:
1. Добавяне на число към извадката.
2. Смятане на медианата на досега добавените числа.
Решението може да е на всякакъв език, но нещата, които ценим, са:
1. Написан е на C++ (CMake for build system)
2. Добре структуриран код ( лесен за четене и разбиране )
3. Има автоматични тестове
4. Хостнат е в github.com (или bitbucket.com, или gitlab.com )
5. Операцийте добавяне на число и смятане на мериана имат минимална алгоритмична сложност

==================================

Няма срок да се предаде решение, но все пак ще е добре ако се вместят в някакви разумни граници.

Бих искал да добавя едно допълнително условие към задачата за домашна работа. Бихме искали версията на С++ да е максимално C++14. Това е.
*/
